# Задача такая, есть 2 файла read_file.txt и write_file.txt
# Строки из файла read_file.txt нужно дописать в write_file.txt
# Скрипт должен запускаться из командной строки, первым позиционным аргументом мы указываем путь к файлу,
# из которого мы будем брать строки, вторым позиционным аргументом передается путь к файлу в который будем дописывать.
# сделать проверку на наличие файлов, если их нет по указаному пути, вывести в консоль оповещение о том что
# файл не найден и прекратить ход выполнения программы.
# Файл в который мы дописываем, нужно переименовать добавить флаг _updated,
# то есть в результате должно получиться: write_file_updated.txt

# Дополнительное условие, предположим что write_file.txt весить 150 гигов, нужно дописывать в его так,
# что бы он весьне попал в оперативную память.


