# Задача 1
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 5.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = []  # объявляем новый список
for e in a:
    if e < 5:
        b.append(e)  # добавляем (append) в список b результаты решения задачи
print(b)

# Задача 2
# Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
# вариант 1 при помощи множеств
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]  # Списки преобразуются во множества с помощью функции set.
c = list(set(a) & set(b))  # знак & выполняется пересечение множеств
print(c)

# вариант 2
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
c = []
for e in a:
    if e in b:
        c.append(e)
print(c)

# Задача 3
# Отсортируйте словарь по значению в порядке возрастания и убывания.
dict1 = {1: 2, 2: 12, 3: 5, 4: 7, 5: 9, 6: 11}
sorted_dict = {}
sorted_keys = sorted(dict1, key=dict1.get, reverse=True)

for e in sorted_keys:
    sorted_dict[e] = dict1[e]

print(sorted_dict)

# Задача 4
# Найдите три ключа с самыми высокими значениями
# в словаре my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}.
my_dict = {'a': 500, 'b': 5874, 'c': 560, 'd': 400, 'e': 5874, 'f': 20}
my_dict1 = sorted(my_dict, key=my_dict.get, reverse=True)[:3]
print(my_dict1)


# Задача 5
# Сделайте так, чтобы число секунд отображалось в виде дни:часы:минуты:секунды.
def convert(seconds):
    days = seconds // (24 * 3600)
    seconds %= 24 * 3600
    hours = seconds // 3600
    seconds %= 3600
    minutes = seconds // 60
    seconds %= 60
    print(f'{days}:{hours}:{minutes}:{seconds}')


convert(3600)