from pprint import pprint


list_1 = [{'adress': 'Ул. Садовая, 11',
  'latlon': ['44.157716123526', '133.26878459718'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 20.00'},
 {'adress': 'Ул. Калининская, 11',
  'latlon': ['44.162017143764', '133.26709928224'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'ЕжедневноПн-Пт: с 08.00 до 20.00; Сб-Вс: с 09.00 до 19.00'},
 {'adress': 'Ул. Калининская, 3',
  'latlon': ['44.159501534156', '133.26391220286'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 20.00'},
 {'adress': 'Ул. Октябрьская, 12',
  'latlon': ['44.16252559177', '133.25603462144'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 20.00'}]

list_2 = [{'adress': 'Ул. Кирова 76Б',
  'latlon': ['43.363291867757', '132.21299209951'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 21.00'},
 {'adress': 'Ул. Партизанская, 2',
  'latlon': ['43.3524', '132.1754'],
  'name': 'Социальная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 22.00'},
 {'adress': 'Ул. Фрунзе, 65',
  'latlon': ['43.3536', '132.1746'],
  'name': 'Семейная аптека',
  'phones': ['8-800-100-000'],
  'working_hours': 'Ежедневнос 8.00 до 20.00'}]

result_list = []

for i in list_1:
    result_list.append(i)
print(result_list)

for i in list_2:
    result_list.append(i)
pprint(result_list)